/*
 * 公司：深圳市联嵌科技有限公司 www.link-embed.com
 * 作者：朱有鹏
 * 项目：C语言指针和数组的初步结合
 * 目的：如果用指针去访问数组
 */
#include <stdio.h>

int main(void)
{
	int a[5] = {555, 444, 333, 222, 111};
	int *p;
	
	//p = &a;			// 编译报警告，但是执行结果是对的，打印555		
	//p = &a[0];		// 相当于 p = &(a[0]); 编译没错没警告，执行也没错，打印555
	p = a;				// 编译没错误没警告，执行也没错，打印555
	
	//a = p;				// 编译报错，因为数组名是个常量，所以不能赋值，所以
							// 数组名不能做左值。
						
	
	printf("*p = %d.\n", *p);	// 555

/*	// 指针+1，表示指向下一格
	p += 1;
	printf("*p = %d.\n", *p);	// 444 a[1]
*/

	//printf("*p++ = %d.\n", *p++);		// 555，++后置，先运算后+1
	//printf("*++p = %d.\n", *++p);		// 444，++前置，指针先加1，然后再*p取值
	//printf("(*p)++ = %d.\n", (*p)++);	// 555，先*p取值，然后给值后置++
	printf("++(*p) = %d.\n", ++(*p));	// 556
	
	return 0;
}














